solidBodyMotion/room/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name AMI1;
        patchInfo
        {
            type            cyclicAMI;
            neighbourPatch  AMI2;
            matchTolerance  0.0001;
            transform       noOrdering;
        }
        constructFrom patches;
        patches (AMI_room);
    }

    {
        name AMI2;
        patchInfo
        {
            type            cyclicAMI;
            neighbourPatch  AMI1;
            matchTolerance  0.0001;
            transform       noOrdering;
        }
        constructFrom patches;
        patches (AMI_sphere);
    }
);

// ************************************************************************* //
