solidBodyMotion/room/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "/surfaceMeshes/geometry.fms";

//minCellSize 0.5;
maxCellSize 0.005;

boundaryLayers
{
	optimiseLayer 	1;
	//untangleLayers	0;
    optimisationParameters
    {
        nSmoothNormals 3;
        maxNumIterations 5;
        featureSizeFactor 0.4;
        reCalculateNormals 1;
        relThicknessTol 0.1;
    }

    patchBoundaryLayers
    {
        AMI
        {
            nLayers           1;
            thicknessRatio    1.2;
            maxFirstLayerThickness 0.02;
            allowDiscontinuity 0;
        }
    }
}

localRefinement
{
	AMI
	{
		additionalRefinementLevels 2;
		//refinementThickness	0.05;
	}
}

objectRefinements
{
	/*nickCyl1
	{
		type	cone;
		additionalRefinementLevels	3;
		p0	(-0.5 0 0);
		p1	(0.75 0 0);
		radius0 0.3;
		radius1 0.3;
	}
	nickCyl2
	{
		type	cone;
		additionalRefinementLevels	2;
		p0	(-0.75 0 0);
		p1	(1.75 0 0);
		radius0 0.75;
		radius1 0.75;
	}
	nickCyl3
	{
		type	cone;
		additionalRefinementLevels	1;
		p0	(-1 0 0);
		p1	(2.75 0 0);
		radius0 1.0;
		radius1 1.0;
	}*/
}

renameBoundary
{
    defaultName fixedWalls;
    defaultType wall;

    newPatchNames
    {
        "box"
        {
            type    wall;
            newName box;
        }

        "AMI"
        {
            type     patch;
            newName  AMI_room;
        }
    }
}


// ************************************************************************* //
